In [5]:
import pandas as pd
import numpy as np
ser1= pd.Series (np.arange(4)*10)
ser1

0     0
1    10
2    20
3    30
dtype: int32

In [2]:
ser1[1:3]

1    10
2    20
dtype: int32

In [3]:
index = ['a','b','c','d']
ser2 = pd.Series(np.arange(4)*10, index)
ser2

a     0
b    10
c    20
d    30
dtype: int32

In [4]:
ser2['b':'c']

b    10
c    20
dtype: int32

In [5]:
data = np.arange(16).reshape((4,4))
index = ['Ohio','Colorado','Utah','New York']
columns = ['one','two','three','four']
df1 = pd.DataFrame(data,index,columns)

In [6]:
df1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [7]:
df1['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [8]:
df1.two

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [9]:
df1[['two','four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [58]:
df1[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [22]:
df1[1:]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
df1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
df1.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [30]:
df1.iloc[1,[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [38]:
df1.iloc[1]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [45]:
df1.loc[['Colorado','Utah','New York'],['two','three']]

          two  three
Colorado    5      6
Utah        9     10
New York   13     14

In [44]:
df1.iloc[[1,2],[1,2]]

          two  three
Colorado    5      6
Utah        9     10

In [71]:
df1.iloc[[0,1,2,df1.shape[0]-1],[1]]

          two
Ohio        1
Colorado    5
Utah        9
New York   13

In [73]:
s1=pd.Series([7.3,-2.5,3.4,1.5], index=['a','b','c','d'])
s2=pd.Series([-2.1,3.6,-1.5,4,3.1], index=['a','c','e','f','g'])

In [74]:
s1+s2

a    5.2
b    NaN
c    7.0
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

In [75]:
s1,s2

(a    7.3
 b   -2.5
 c    3.4
 d    1.5
 dtype: float64,
 a   -2.1
 c    3.6
 e   -1.5
 f    4.0
 g    3.1
 dtype: float64)

In [78]:
df1 =pd.DataFrame(np.arange(12).reshape((3,4)),
                  columns = ['a','b','c','d'])
df2 =pd.DataFrame(np.arange(20).reshape((4,5)),
                  columns = ['a','b','c','d','e'])
df2.loc[1,'b']= np.nan

In [79]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [81]:
df1.add(df2, fill_value=0) # nan값을 0으로 바꿔서 계산을 해줌

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [82]:
df1.add(df2, fill_value=2)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   6.0
1   9.0   7.0  13.0  15.0  11.0
2  18.0  20.0  22.0  24.0  16.0
3  17.0  18.0  19.0  20.0  21.0

In [96]:
df1.add(df2, fill_value=sum(df1.mean()[0:4])/4) #df1의 nan값을 전체의 값의 평균 대치

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   9.5
1   9.0  10.5  13.0  15.0  14.5
2  18.0  20.0  22.0  24.0  19.5
3  20.5  21.5  22.5  23.5  24.5

In [95]:
sum(df1.mean()[0:4])/4

5.5

In [98]:
df1.mean()

a    4.0
b    5.0
c    6.0
d    7.0
dtype: float64

In [8]:
frame =pd.DataFrame(np.random.randn(4,3),
                  columns = ['b','d','e'],
                  index =['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah   -1.221438  0.003770  0.360606
Ohio    0.327419 -2.947275 -0.575303
Texas  -0.355594 -0.303156 -0.675740
Oregon  0.045295  0.409794  1.517220

In [9]:
np.abs(frame)

               b         d         e
Utah    1.221438  0.003770  0.360606
Ohio    0.327419  2.947275  0.575303
Texas   0.355594  0.303156  0.675740
Oregon  0.045295  0.409794  1.517220

In [11]:
frame.apply(lambda x: x.max()-x.min(),
           axis=1) #1은 행으로 계산해줌 #0은 열로 계산해줌

Utah      1.582044
Ohio      3.274694
Texas     0.372583
Oregon    1.471926
dtype: float64

In [12]:
frame.apply(lambda x: x.max()-x.min(),
           axis=0) #axis=1은 행으로 계산해줌 / axis=0은 열로 계산해줌

b    1.548857
d    3.357069
e    2.192960
dtype: float64

In [13]:
frame.apply(lambda x: x.max()-x.min(),
           axis='columns') #axis=1과 동일함

Utah      1.582044
Ohio      3.274694
Texas     0.372583
Oregon    1.471926
dtype: float64

In [14]:
frame.apply(lambda x: x.max()-x.min(),
           axis='index') #axis=0과 동일함

b    1.548857
d    3.357069
e    2.192960
dtype: float64

In [16]:
def f(x): 
    data = [x.min(), x.max()]
    index = ['min','max']
    return pd.Series(data,index)

frame.apply(f)

            b         d        e
min -1.221438 -2.947275 -0.67574
max  0.327419  0.409794  1.51722

In [21]:
format = lambda x: '%.2f' % x

In [23]:
frame.applymap(format) #원하는 형식으로 세팅해주면 원하는대로 형식이 적용된다.

            b      d      e
Utah    -1.22   0.00   0.36
Ohio     0.33  -2.95  -0.58
Texas   -0.36  -0.30  -0.68
Oregon   0.05   0.41   1.52

In [24]:
frame['e'].map(format) #원하는 부분만 형식 적용

Utah       0.36
Ohio      -0.58
Texas     -0.68
Oregon     1.52
Name: e, dtype: object

In [26]:
obj = pd.Series(range(4), index=['d','a','b','c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [27]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [28]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index=['three','one'],
                    columns=['d','a','b','c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [29]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [30]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [33]:
frame.sort_index(axis=1).sort_index() # 가로 세로 모두 정렬

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [34]:
obj = pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [41]:
obj=pd.Series([7,-5,7,4,2,0,4])

In [42]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [43]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [45]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [60]:
s6 = pd.Series(range(5), index=['kim','kim','Lee','Lee','Park'])

In [61]:
s6.index.is_unique #고유한 것들만 있나? 중복이 없나?

False

In [62]:
s6 = pd.Series(range(5), index=['kim1','kim2','Lee1','Lee2','Park'])
s6.index.is_unique #중복이 있다

True

In [66]:
s6['kim1']

0